#!/usr/bin/perl -w

#author: Chen Zhaoqiang
#data:   2014-05-16
#contact:   744891290@qq.com
#don't use the module of vector


use strict;
use Storable qw(dclone);
use Math::Trig;
use constant   PI=>3.1415926535897932384626;   #433832795028841971693993751;









######input START####


my @dihe=(18,16,15,10);
my %coor;
while(<DATA>)
{
	my @elements=split(/\s+/,$_);

	$coor{$.}{'atomtype'}=$elements[0];
	$coor{$.}{'x'}=$elements[1];
	$coor{$.}{'y'}=$elements[2];
	$coor{$.}{'z'}=$elements[3];
}

######input END#####


###output START#####
print &calcdiheangle(\%coor,\@dihe);


#####output END####








sub calcdiheangle
{
	my %hash=%{dclone($_[0])};
	my @atomnums=@{$_[1]};
	my %atom1;
	my %atom2;
	my %atom3;
	my %atom4;
	
	  $atom1{'x'}=$hash{$atomnums[0]}{'x'};
	 $atom1{'y'}=$hash{$atomnums[0]}{'y'};
	 $atom1{'z'}=$hash{$atomnums[0]}{'z'};

	  $atom2{'x'}=$hash{$atomnums[1]}{'x'};
	 $atom2{'y'}=$hash{$atomnums[1]}{'y'};
	 $atom2{'z'}=$hash{$atomnums[1]}{'z'};
	
  	$atom3{'x'}=$hash{$atomnums[2]}{'x'};
	 $atom3{'y'}=$hash{$atomnums[2]}{'y'};
	 $atom3{'z'}=$hash{$atomnums[2]}{'z'};

	$atom4{'x'}=$hash{$atomnums[3]}{'x'};
	 $atom4{'y'}=$hash{$atomnums[3]}{'y'};
	 $atom4{'z'}=$hash{$atomnums[3]}{'z'};
	 
	 my @v1=($atom2{'x'}-$atom1{'x'},$atom2{'y'}-$atom1{'y'},$atom2{'z'}-$atom1{'z'});
   my @v2=($atom3{'x'}-$atom2{'x'},$atom3{'y'}-$atom2{'y'},$atom3{'z'}-$atom2{'z'});
   my @v3=($atom4{'x'}-$atom3{'x'},$atom4{'y'}-$atom3{'y'},$atom4{'z'}-$atom3{'z'});
    
    
    
 #   a×b=(aybz-azby)i+(azbx-axbz)j+(axby-aybx)k,为了帮助记忆，利用三阶行列式，写成

       my @v3_x_v2 = 
       (
    
       $v3[1]*$v2[2]-$v3[2]*$v2[1],
       $v3[2]*$v2[0]-$v3[0]*$v2[2],
       $v3[0]*$v2[1]-$v3[1]*$v2[0]
    
       );
       
       print "\n";
       
       print join "  ",@v3_x_v2;
       print "\n";
       
     
    my @v2_x_v1 =
    (
      $v2[1]*$v1[2]-$v2[2]*$v1[1],
       $v2[2]*$v1[0]-$v2[0]*$v1[2],
       $v2[0]*$v1[1]-$v2[1]*$v1[0]
    );
      print "\n";
       
       print join "  ",@v2_x_v1;
       print "\n";
     
     
    my $sign = $v1[0] * $v3_x_v2[0]+$v1[1] * $v3_x_v2[1]+$v1[2] * $v3_x_v2[2];

    my $dist_v3v2=sqrt($v3_x_v2[0]**2+$v3_x_v2[1]**2+$v3_x_v2[2]**2);
    
    my $dist_v2v1=sqrt($v2_x_v1[0]**2+$v2_x_v1[1]**2+$v2_x_v1[2]**2);
    
    my $dot=$v3_x_v2[0]*$v2_x_v1[0]+$v3_x_v2[1]*$v2_x_v1[1]+$v3_x_v2[2]*$v2_x_v1[2];
    
    my $dihe = acos($dot/$dist_v2v1/$dist_v3v2);
   # print $dihe/PI*180,"\n";
    $dihe *= -1 if ( $sign > 0 );
    return $dihe/PI*180;

}




__DATA__
N                2.372  -0.007   0.043  0.00  0.00             
N               -0.775   4.726  -0.592  0.00  0.00             
C                3.952  -2.460  -0.386  0.00  0.00             
C                2.593  -2.466   0.310  0.00  0.00             
C                4.594  -1.085  -0.218  0.00  0.00             
C                1.713  -1.332  -0.199  0.00  0.00             
C                3.664   0.014  -0.718  0.00  0.00             
C                4.851  -3.547   0.174  0.00  0.00             
C                1.528   1.163  -0.126  0.00  0.00             
C                0.237   1.262   0.429  0.00  0.00             
C                2.074   2.333  -0.691  0.00  0.00             
C               -0.504   2.437   0.289  0.00  0.00             
C                1.350   3.505  -0.807  0.00  0.00             
C                0.030   3.561  -0.340  0.00  0.00             
C               -0.424   0.234   1.299  0.00  0.00             
C               -1.599  -0.489   0.720  0.00  0.00             
C               -1.745  -0.607  -0.665  0.00  0.00             
C               -2.557  -1.054   1.566  0.00  0.00             
C               -1.823   5.032   0.397  0.00  0.00             
C               -2.835  -1.279  -1.202  0.00  0.00             
C               -3.652  -1.725   1.035  0.00  0.00             
C               -3.785  -1.834  -0.347  0.00  0.00             
O               -0.066   0.058   2.449  0.00  0.00             
Cl              -5.109  -2.647  -0.994  0.00  0.00          C  
H                3.797  -2.651  -1.477  0.00  0.00             
H                2.728  -2.388   1.408  0.00  0.00             
H                2.082  -3.433   0.135  0.00  0.00             
H                5.549  -1.039  -0.778  0.00  0.00             
H                4.858  -0.916   0.845  0.00  0.00             
H                1.492  -1.468  -1.282  0.00  0.00             
H                0.734  -1.378   0.315  0.00  0.00             
H                4.152   1.003  -0.576  0.00  0.00             
H                3.490  -0.093  -1.811  0.00  0.00             
H                5.038  -3.408   1.248  0.00  0.00             
H                4.401  -4.540   0.045  0.00  0.00             
H                5.826  -3.556  -0.330  0.00  0.00             
H                3.113   2.338  -1.058  0.00  0.00             
H               -1.526   2.490   0.702  0.00  0.00             
H                1.821   4.383  -1.265  0.00  0.00             
H               -0.201   5.523  -0.764  0.00  0.00             
H               -0.991  -0.162  -1.328  0.00  0.00             
H               -2.442  -0.973   2.655  0.00  0.00             
H               -1.443   5.487   1.324  0.00  0.00             
H               -2.361   4.109   0.671  0.00  0.00             
H               -2.538   5.727  -0.061  0.00  0.00             
H               -2.952  -1.373  -2.287  0.00  0.00             
H               -4.406  -2.169   1.694  0.00  0.00             